const handler = async (m, {conn}) => {
  m.reply(global.Femvivido18);
};
handler.command = /^(Femvivido18|femvivido18)$/i;
export default handler;
handler.admin = true
handler.group = true
handler.botAdmin = true

global.Femvivido18 = ` 
┏━━━━━━🐲𝐕𝐒 𝐅𝐄𝐌🐲━━━━━━┓
┃
┃            ✨ 𝑳𝒖𝒄𝒌𝒚𝑩𝒐𝒕-𝑴𝑫 ✨
┃           ₊˚︶︶︶︶︶︶︶︶˚ ‧₊
┃
┃      ෆ 𝘔𝘰𝘥𝘰: 𝚅𝙸𝚅𝙸𝙳𝙾
┃      ෆ 𝘏𝘰𝘳𝘢𝘳𝘪𐐫:
┃    ‧₊⏰ 18 🇵🇪 ⌇ 19 🇧🇴 ⌇ 20 🇦🇷    
┃
┃ㅤㅤʚ 𝙹𝚄𝙶𝙰𝙳𝙾𝚁𝙰𝚂💫:
┃
┣・🐲• 
┣・🐲• 
┣・🐲• 
┣・🐲•
┃   ㅤㅤ
┃ㅤㅤʚ 𝚂𝚄𝙿𝙻𝙴𝙽𝚃𝙴𝚂💫:
┣・🐲•
┣・🐲•
┃
┃  ⊹ ִֶָ𝙳𝙾𝙽𝙰𝙳𝙾𝚁𝙰 𝙳𝙴 𝚂𝙰𝙻𝙰💫: 
┃ㅤ
┣・🐲•
┗━━━━━━━━━━━━━━━━━━━━━┛
`;