const handler = async (m, {conn}) => {
  m.reply(global.Fem00);
};
handler.command = /^(Feminfinito00|feminfinito00)$/i;
export default handler;
handler.admin = true
handler.group = true
handler.botAdmin = true

global.Fem00 = ` 
┏━━━━━━━━━━━━━━━━━━━━━┓
┃
┃            ✨ 𝙓𝙞𝙖𝘽𝙤𝙩-𝙋𝙧𝙤 ✨
┃           ₊˚︶︶︶︶︶︶︶︶˚ ‧₊
┃
┃      ෆ 𝘔𝘰𝘥𝘰: 𝙸𝙽𝙵𝙸𝙽𝙸𝚃𝙾
┃      ෆ 𝘏𝘰𝘳𝘢𝘳𝘪𐐫:
┃    ‧₊⏰ 00 🇵🇪 ⌇ 01 🇧🇴 ⌇ 02 🇦🇷      
┃
┃ㅤㅤʚ 𝙹𝚄𝙶𝙰𝙳𝙾𝚁𝙰𝚂💫:
┃
┣・🔮 ➤ 
┣・🔮 ➤ 
┣・🔮 ➤ 
┣・🔮 ➤
┃   ㅤㅤ
┃ㅤㅤʚ 𝚂𝚄𝙿𝙻𝙴𝙽𝚃𝙴𝚂💫:
┣・🔮 ➤
┣・🔮 ➤
┃
┃  ⊹ ִֶָ𝙳𝙾𝙽𝙰𝙳𝙾𝚁𝙰 𝙳𝙴 𝚂𝙰𝙻𝙰💫: 
┃ㅤ
┣・🔮 ➤
┗━━━━━━━━━━━━━━━━━━━━━┛
`;