const handler = async (m, {conn}) => {
  m.reply(global.Mascvivido20);
};
handler.command = /^(Mascvivido20|mascvivido20)$/i;
export default handler;
handler.admin = true
handler.group = true
handler.botAdmin = true

global.Mascvivido20 = ` 
┏━━━━━━━━━━━━━━━━━━━━━┓
┃
┃            ✨ 𝙓𝙞𝙖𝘽𝙤𝙩-𝙋𝙧𝙤 ✨
┃           ₊˚︶︶︶︶︶︶︶︶˚ ‧₊
┃
┃      ෆ 𝘔𝘰𝘥𝘰: 𝚅𝙸𝚅𝙸𝙳𝙾
┃      ෆ 𝘏𝘰𝘳𝘢𝘳𝘪𐐫:
┃    ‧₊⏰ 20 🇵🇪 ⌇ 21 🇧🇴 ⌇ 22 🇦🇷      
┃
┃ㅤㅤʚ 𝙹𝚄𝙶𝙰𝙳𝙾𝚁𝙴𝚂💫:
┃
┣・🔮 ➤ 
┣・🔮 ➤ 
┣・🔮 ➤ 
┣・🔮 ➤
┃   ㅤㅤ
┃ㅤㅤʚ 𝚂𝚄𝙿𝙻𝙴𝙽𝚃𝙴𝚂💫:
┣・🔮 ➤
┣・🔮 ➤
┃
┃  ⊹ ִֶָ𝙳𝙾𝙽𝙰𝙳𝙾𝚁 𝙳𝙴 𝚂𝙰𝙻𝙰💫: 
┃ㅤ
┣・🔮 ➤
┗━━━━━━━━━━━━━━━━━━━━━┛
`;