const handler = async (m, {conn, usedPrefix}) => {
  const pp = imagen4;
  try {
  } catch (e) {
  } finally {
    const name = await conn.getName(m.sender);
    const taguser = '@' + m.sender.split('@s.whatsapp.net')[0];
    const str = `┏━━━━•💌 𝙓𝙞𝙖𝘽𝙤𝙩-𝙈𝘿 💌•━━━━┓
│╭─────────♡─────────╮
││•🔮¡𝙃𝙊𝙇𝘼! @${m.sender.split`@`[0]}
│╰─────────♡─────────╯
││•🔮𝘾𝙍𝙀𝘼𝘿𝙊𝙍/𝘼 
││•🔮 wa.me/59168683798
││•🔮𝙑𝙀𝙍𝙎𝙄𝙊𝙉 𝘿𝙀𝙇 𝘽𝙊𝙏: 𝟹.𝟸.𝟷
││•🔮𝙁𝙀𝘾𝙃𝘼: ${date}
││•🔮𝙏𝙄𝙀𝙈𝙋𝙊 𝘼𝘾𝙏: ${uptime}                                            
┗━━━━━━━━•◦ 🤖 ◦•━━━━━━━━┛

𝙰𝚀𝚄𝙸 𝙿𝚄𝙴𝙳𝙴 𝙶𝚄𝙰𝚁𝙳𝙰𝚁 𝙼𝙴𝙽𝚂𝙰𝙹𝙴𝚂
𝚀𝚄𝙴 𝚀𝚄𝙸𝙴𝚁𝙰𝚂 𝚅𝙴𝚁 𝙼𝙰𝚂 𝚃𝙰𝚁𝙳𝙴

┏━━━━━━━━━━━━━━━━━━━━━┓
┃「🗳️𝘼𝙂𝙍𝙀𝙂𝘼𝙍 𝘼𝙇𝘼 𝙇𝙄𝙎𝙏𝘼🗳️」
┃╭───────⧟⭑⧟───────•
┃│🗳️.𝘢𝘨𝘳𝘦𝘨𝘢𝘳𝘮𝘴𝘨
┃│<𝚝𝚎𝚡𝚝𝚘/𝚌𝚘𝚖𝚊𝚗𝚍𝚘/𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎>
┃│(𝚛𝚎𝚜𝚙𝚘𝚗𝚍𝚎 𝚊 𝚞𝚗 𝚝𝚎𝚡𝚝𝚘)
┃│🗳️.𝘢𝘨𝘳𝘦𝘨𝘢𝘳𝘷𝘯
┃│<𝚝𝚎𝚡𝚝𝚘/𝚌𝚘𝚖𝚊𝚗𝚍𝚘/𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎>
┃│(𝚛𝚎𝚜𝚙𝚘𝚗𝚍𝚎 𝚊 𝚞𝚗𝚊 𝚗𝚘𝚝𝚊 𝚍𝚎 𝚟𝚘𝚣)
┃│🗳️.𝘢𝘨𝘳𝘦𝘨𝘢𝘳𝘷𝘪𝘥𝘦𝘰
┃│<𝚝𝚎𝚡𝚝𝚘/𝚌𝚘𝚖𝚊𝚗𝚍𝚘/𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎>
┃│(𝚛𝚎𝚜𝚙𝚘𝚗𝚍𝚎 𝚊 𝚞𝚗 𝚟𝚒𝚍𝚎𝚘)
┃│🗳️.𝘢𝘨𝘳𝘦𝘨𝘢𝘳𝘢𝘶𝘥𝘪𝘰
┃│<𝚝𝚎𝚡𝚝𝚘/𝚌𝚘𝚖𝚊𝚗𝚍𝚘/𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎>
┃│(𝚛𝚎𝚜𝚙𝚘𝚗𝚍𝚎 𝚊 𝚞𝚗 𝚊𝚞𝚍𝚒𝚘)
┃│🗳️.𝘢𝘨𝘳𝘦𝘨𝘢𝘳𝘪𝘮𝘨
┃│<𝚝𝚎𝚡𝚝𝚘/𝚌𝚘𝚖𝚊𝚗𝚍𝚘/𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎>
┃│(𝚛𝚎𝚜𝚙𝚘𝚗𝚍𝚎 𝚊 𝚞𝚗𝚊 𝚒𝚖𝚊𝚐𝚎𝚗)
┃│🗳️.𝘢𝘨𝘳𝘦𝘨𝘢𝘳𝘴𝘵𝘪𝘤𝘬𝘦𝘳
┃│<𝚝𝚎𝚡𝚝𝚘/𝚌𝚘𝚖𝚊𝚗𝚍𝚘/𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎>
┃│(𝚛𝚎𝚜𝚙𝚘𝚗𝚍𝚎 𝚊 𝚞𝚗 𝚜𝚝𝚒𝚌𝚔𝚎𝚛)
┃╰───────⧟⭑⧟───────•
┗━━━━━━━━━━━━━━━━━━━━━┛


┏━━━━━━━━━━━━━━━━━━━━━┓
┃「 🗳️𝘾𝙊𝙈𝘼𝙉𝘿𝙊𝙎🗳️ 」
┃╭───────⧟⭑⧟───────•
┃│🗳️.𝘭𝘪𝘴𝘵𝘢𝘮𝘴𝘨 
┃│🗳️.𝘭𝘪𝘴𝘵𝘢𝘷𝘯 
┃│🗳️.𝘭𝘪𝘴𝘵𝘢𝘷𝘪𝘥𝘦𝘰 
┃│🗳️.𝘭𝘪𝘴𝘵𝘢𝘢𝘶𝘥𝘪𝘰 
┃│🗳️.𝘭𝘪𝘴𝘵𝘢𝘪𝘮𝘨 
┃│🗳️.𝘭𝘪𝘴𝘵𝘢𝘴𝘵𝘪𝘤𝘬𝘦𝘳
┃╰───────⧟⭑⧟───────•
┗━━━━━━━━━━━━━━━━━━━━━┛


┏━━━━━━━━━━━━━━━━━━━━━┓
┃「 🗳️𝙏𝙀𝙓𝙏𝙊𝙎/𝘼𝙍𝘾𝙃𝙄𝙑𝙊𝙎🗳️ 」
┃╭───────⧟⭑⧟───────•
┃│🗳️.𝘷𝘦𝘳𝘮𝘴𝘨
┃│<𝚝𝚎𝚡𝚝𝚘/𝚌𝚘𝚖𝚊𝚗𝚍𝚘/𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎>
┃│🗳️.𝘷𝘦𝘳𝘷𝘯
┃│<𝚝𝚎𝚡𝚝𝚘/𝚌𝚘𝚖𝚊𝚗𝚍𝚘/𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎>
┃│🗳️.𝘷𝘦𝘳𝘷𝘪𝘥𝘦𝘰
┃│<𝚝𝚎𝚡𝚝𝚘/𝚌𝚘𝚖𝚊𝚗𝚍𝚘/𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎>
┃│🗳️.𝘷𝘦𝘳𝘢𝘶𝘥𝘪𝘰
┃│<𝚝𝚎𝚡𝚝𝚘/𝚌𝚘𝚖𝚊𝚗𝚍𝚘/𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎>
┃│🗳️.𝘷𝘦𝘳𝘪𝘮𝘨
┃│<𝚝𝚎𝚡𝚝𝚘/𝚌𝚘𝚖𝚊𝚗𝚍𝚘/𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎>
┃│🗳️.𝘷𝘦𝘳𝘴𝘵𝘪𝘤𝘬𝘦𝘳
┃│<𝚝𝚎𝚡𝚝𝚘/𝚌𝚘𝚖𝚊𝚗𝚍𝚘/𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎>
┃╰───────⧟⭑⧟───────•
┗━━━━━━━━━━━━━━━━━━━━━┛


┏━━━━━━━━━━━━━━━━━━━━━┓
┃「 🗳️𝙀𝙇𝙄𝙈𝙄𝙉𝘼𝙍🗳️ 」
┃╭───────⧟⭑⧟───────•
┃│🗳️.𝘦𝘭𝘪𝘮𝘪𝘯𝘢𝘳𝘮𝘴𝘨 
┃│<𝚝𝚎𝚡𝚝𝚘/𝚌𝚘𝚖𝚊𝚗𝚍𝚘/𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎>
┃│🗳️.𝘦𝘭𝘪𝘮𝘪𝘯𝘢𝘳𝘷𝘯
┃│<𝚝𝚎𝚡𝚝𝚘/𝚌𝚘𝚖𝚊𝚗𝚍𝚘/𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎>
┃│🗳️.𝘦𝘭𝘪𝘮𝘪𝘯𝘢𝘳𝘷𝘪𝘥𝘦𝘰
┃│<𝚝𝚎𝚡𝚝𝚘/𝚌𝚘𝚖𝚊𝚗𝚍𝚘/𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎>
┃│🗳️.𝘦𝘭𝘪𝘮𝘪𝘯𝘢𝘳𝘢𝘶𝘥𝘪𝘰
┃│<𝚝𝚎𝚡𝚝𝚘/𝚌𝚘𝚖𝚊𝚗𝚍𝚘/𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎>
┃│🗳️.𝘦𝘭𝘪𝘮𝘪𝘯𝘢𝘳𝘪𝘮𝘨
┃│<𝚝𝚎𝚡𝚝𝚘/𝚌𝚘𝚖𝚊𝚗𝚍𝚘/𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎>
┃│🗳️.𝘦𝘭𝘪𝘮𝘪𝘯𝘢𝘳𝘴𝘵𝘪𝘤𝘬𝘦𝘳
┃│<𝚝𝚎𝚡𝚝𝚘/𝚌𝚘𝚖𝚊𝚗𝚍𝚘/𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎>
┃╰───────⧟⭑⧟───────•
┗━━━━━━━━━━━━━━━━━━━━━┛`.trim();
    if (m.isGroup) {
      conn.sendMessage(m.chat, {image: pp, caption: str.trim(), mentions: [...str.matchAll(/@([0-9]{5,16}|0)/g)].map((v) => v[1] + '@s.whatsapp.net')}, {quoted: m});
    } else {
      const fkontak2 = {'key': {'participants': '0@s.whatsapp.net', 'remoteJid': 'status@broadcast', 'fromMe': false, 'id': 'Halo'}, 'message': {'contactMessage': {'vcard': `BEGIN:VCARD\nVERSION:3.0\nN:Sy;Bot;;;\nFN:y\nitem1.TEL;waid=${m.sender.split('@')[0]}:${m.sender.split('@')[0]}\nitem1.X-ABLabel:Ponsel\nEND:VCARD`}}, 'participant': '0@s.whatsapp.net'};
      conn.sendMessage(m.chat, {image: pp, caption: str.trim(), mentions: [...str.matchAll(/@([0-9]{5,16}|0)/g)].map((v) => v[1] + '@s.whatsapp.net')}, {quoted: fkontak2});
    }
    // conn.sendButton(m.chat, str, wm, pp, [['𝙼𝙴𝙽𝚄 𝙿𝚁𝙸𝙽𝙲𝙸𝙿𝙰𝙻', '/menu']], m, { mentions: [m.sender] })
  }
};
handler.help = ['cajafuerte'];
handler.tags = ['owner'];
handler.command = /^(cajafuerte)$/i;
handler.rowner = true;
handler.fail = null;
export default handler;