import fetch from 'node-fetch';
const handler = async (m, {conn, usedPrefix, usedPrefix: _p, __dirname, text, isPrems}) => {
  if (usedPrefix == 'a' || usedPrefix == 'A') return;
  try {
    const pp = imagen1;
    // let vn = './media/menu.mp3'
    const img = './Menu2.jpg';
    const d = new Date(new Date + 3600000);
    const locale = 'es';
    const week = d.toLocaleDateString(locale, {weekday: 'long'});
    const date = d.toLocaleDateString(locale, {day: 'numeric', month: 'long', year: 'numeric'});
    const _uptime = process.uptime() * 1000;
    const uptime = clockString(_uptime);
    const user = global.db.data.users[m.sender];
    const {money, joincount} = global.db.data.users[m.sender];
    const {exp, limit, level, role} = global.db.data.users[m.sender];
    const rtotalreg = Object.values(global.db.data.users).filter((user) => user.registered == true).length;
    const rtotal = Object.entries(global.db.data.users).length || '0'
    const more = String.fromCharCode(8206);
    const readMore = more.repeat(850);
    const taguser = '@' + m.sender.split('@s.whatsapp.net')[0];
    const doc = ['pdf', 'zip', 'vnd.openxmlformats-officedocument.presentationml.presentation', 'vnd.openxmlformats-officedocument.spreadsheetml.sheet', 'vnd.openxmlformats-officedocument.wordprocessingml.document'];
    const document = doc[Math.floor(Math.random() * doc.length)];
    const str = `┏━━━━•💌 𝙓𝙞𝙖𝘽𝙤𝙩-𝙈𝘿 💌•━━━━┓
┃╭─────────♡─────────╮
┃│•🔮¡𝙃𝙊𝙇𝘼! @${m.sender.split`@`[0]}
┃╰─────────♡─────────╯
┃│•🔮𝘾𝙍𝙀𝘼𝘿𝙊𝙍/𝘼 
┃│•🔮 wa.me/59168683798
┃│•🔮𝙑𝙀𝙍𝙎𝙄𝙊𝙉 𝘿𝙀𝙇 𝘽𝙊𝙏: 𝟹.𝟸.𝟷
┃│•🔮𝙁𝙀𝘾𝙃𝘼: ${date}
┃│•🔮𝙉𝙄𝙑𝙀𝙇: ${level}
┃│•🔮𝙀𝙓𝙋: ${exp} 
┃│•🔮𝙍𝘼𝙉𝙂𝙊: ${role} 
┃│•🔮𝘿𝙄𝘼𝙈𝘼𝙉𝙏𝙀𝙎: ${limit}
┃│•🔮𝙓𝙄𝘼𝘾𝙊𝙄𝙉𝙎: ${money}
┃│•🔮𝙏𝙊𝙆𝙀𝙉𝙎: ${joincount}
┃│•🔮𝙏𝙄𝙀𝙈𝙋𝙊 𝘼𝘾𝙏: ${uptime}                                            
┗━━━━━━━━•◦ 🤖 ◦•━━━━━━━━┛

 
┏━━━━━━━━━━━━━━━━━━━━━┓
┃「 🟢𝙊𝙉/𝙊𝙁𝙁🔴 」
┃╭───────⧟⭑⧟───────•
┃┊🟢.𝘌𝘯𝘢𝘣𝘭𝘦
┃┊🔴.𝘋𝘪𝘴𝘢𝘣𝘭𝘦
┃╰───────⧟⭑⧟───────•
┗━━━━━━━━━━━━━━━━━━━━━┛


┏━━━━━━━━━━━━━━━━━━━━━┓
┃「 ❄️𝙂𝙍𝙐𝙋𝙊𝙎❄️ 」
┃╭───────⧟⭑⧟───────•
┃┊❄️.𝘔𝘦𝘯𝘶𝘧𝘧
┃┊❄️.𝘊𝘰𝘮𝘢𝘯𝘥𝘰𝘴𝘧𝘧 
┃┊❄️.𝘒𝘪𝘤𝘬
┃┊❄️.𝘎𝘳𝘶𝘱𝘰
┃┊❄️.𝘗𝘳𝘰𝘮𝘰𝘵𝘦
┃┊❄️.𝘋𝘦𝘮𝘰𝘵𝘦
┃┊❄️.𝘓𝘪𝘯𝘬
┃┊❄️.𝘛𝘰𝘥𝘰𝘴
┃┊❄️.𝘚𝘦𝘵𝘸𝘦𝘭𝘤𝘰𝘮𝘦 
┃┊❄️.𝘚𝘦𝘵𝘣𝘺𝘦 
┃┊❄️.𝘕𝘰𝘵𝘪𝘧𝘺 
┃┊❄️.𝘍𝘢𝘯𝘵𝘢𝘴𝘮𝘢𝘴 
┃┊❄️.𝘒𝘪𝘤𝘬𝘧𝘢𝘯𝘵𝘢𝘴𝘮𝘢𝘴
┃╰───────⧟⭑⧟───────•
┗━━━━━━━━━━━━━━━━━━━━━┛
 

┏━━━━━━━━━━━━━━━━━━━━━┓
┃「 💥𝙁𝙍𝙀𝙀 𝙁𝙄𝙍𝙀💥 」
┃╭───────⧟⭑⧟───────•
┃┊🗺️.𝙢𝙚𝙣𝙪𝙛𝙛
┃┊🗺️.𝙗𝙚𝙧𝙢𝙪𝙙𝙖
┃┊🗺️.𝙠𝙖𝙡𝙖𝙝𝙖𝙧𝙞
┃┊🗺️.𝙖𝙡𝙥𝙚𝙨
┃┊🗺️.𝙥𝙪𝙧𝙜𝙖𝙩𝙤𝙧𝙞𝙤
┃┊🗺️.𝙣𝙚𝙭𝙩𝙚𝙧𝙧𝙖
┃┊🗺️.𝙖𝙜𝙚𝙣𝙙𝙖𝙨𝙚𝙢𝙖𝙣𝙖𝙡
┃╰───────⧟⭑⧟───────•
┗━━━━━━━━━━━━━━━━━━━━━┛


┏━━━━━━━━━━━━━━━━━━━━━┓
┃「 🔱𝘽𝙐𝙎𝘾𝘼𝙍 𝙑𝙎🔱 」
┃╭───────⧟⭑⧟───────•
┃┊🔱.𝙗𝙪𝙨𝙘𝙖𝙧𝙫𝙨𝙢𝙖𝙨𝙘
┃┊🔱.𝙗𝙨𝙢𝙨𝙖𝙘
┃┊🔱.𝙗𝙪𝙨𝙘𝙖𝙧𝙫𝙨𝙛𝙚𝙢
┃┊🔱.𝙗𝙨𝙛𝙚𝙢
┃┊🔱.𝙗𝙪𝙨𝙘𝙖𝙧𝙫𝙨𝙢𝙞𝙭𝙩𝙤
┃┊🔱.𝙗𝙨𝙢𝙞𝙭𝙩𝙤
┃╰───────⧟⭑⧟───────•
┗━━━━━━━━━━━━━━━━━━━━━┛


┏━━━━━━━━━━━━━━━━━━━━━┓
┃「 🧝🏼‍♀️𝙇𝙄𝙎𝙏𝘼𝙎 𝙁𝙀𝙈🧝🏼‍♀️ 」
┃╭───────⧟⭑⧟───────•
┃┊🧝🏼‍♀️.𝙛𝙚𝙢𝙞𝙣𝙛𝙞𝙣𝙞𝙩𝙤14
┃┊🧝🏼‍♀️.𝙛𝙚𝙢𝙞𝙣𝙛𝙞𝙣𝙞𝙩𝙤16
┃┊🧝🏼‍♀️.𝙛𝙚𝙢𝙞𝙣𝙛𝙞𝙣𝙞𝙩𝙤18
┃┊🧝🏼‍♀️.𝙛𝙚𝙢𝙞𝙣𝙛𝙞𝙣𝙞𝙩𝙤20
┃┊🧝🏼‍♀️.𝙛𝙚𝙢𝙞𝙣𝙛𝙞𝙣𝙞𝙩𝙤22
┃┊🧝🏼‍♀️.𝙛𝙚𝙢𝙞𝙣𝙛𝙞𝙣𝙞𝙩𝙤00
┃┊🧝🏼‍♀️.𝙛𝙚𝙢𝙞𝙣𝙛𝙞𝙣𝙞𝙩𝙤𝙫𝙨
┃┊🧝🏼‍♀️.𝙛𝙚𝙢𝙫𝙞𝙫𝙞𝙙𝙤14
┃┊🧝🏼‍♀️.𝙛𝙚𝙢𝙫𝙞𝙫𝙞𝙙𝙤16
┃┊🧝🏼‍♀️.𝙛𝙚𝙢𝙫𝙞𝙫𝙞𝙙𝙤18
┃┊🧝🏼‍♀️.𝙛𝙚𝙢𝙫𝙞𝙫𝙞𝙙𝙤20
┃┊🧝🏼‍♀️.𝙛𝙚𝙢𝙫𝙞𝙫𝙞𝙙𝙤22
┃┊🧝🏼‍♀️.𝙛𝙚𝙢𝙫𝙞𝙫𝙞𝙙𝙤00
┃┊🧝🏼‍♀️.𝙛𝙚𝙢𝙫𝙞𝙫𝙞𝙙𝙤𝙫𝙨
┃┊🧝🏼‍♀️.𝙛𝙚𝙢8𝙫𝙨8
┃┊🧝🏼‍♀️.𝙛𝙚𝙢12𝙫𝙨12
┃┊🧝🏼‍♀️.𝙛𝙚𝙢16𝙫𝙨16
┃┊🧝🏼‍♀️.𝙛𝙚𝙢𝙞𝙣𝙩𝙚𝙧𝙣𝙖4
┃┊🧝🏼‍♀️.𝙛𝙚𝙢𝙞𝙣𝙩𝙚𝙧𝙣𝙖6
┃╰───────⧟⭑⧟───────•
┗━━━━━━━━━━━━━━━━━━━━━┛


┏━━━━━━━━━━━━━━━━━━━━━┓
┃「 ☮️𝙇𝙄𝙎𝙏𝘼𝙎 𝙈𝘼𝙎𝘾☮️ 」
┃╭───────⧟⭑⧟───────•
┃│🧝🏼.𝙢𝙖𝙨𝙘𝙞𝙣𝙛𝙞𝙣𝙞𝙩𝙤14
┃│🧝🏼.𝙢𝙖𝙨𝙘𝙞𝙣𝙛𝙞𝙣𝙞𝙩𝙤16
┃│🧝🏼.𝙢𝙖𝙨𝙘𝙞𝙣𝙛𝙞𝙣𝙞𝙩𝙤18
┃│☮️.𝙢𝙖𝙨𝙘𝙞𝙣𝙛𝙞𝙣𝙞𝙩𝙤20
┃│☮️.𝙢𝙖𝙨𝙘𝙞𝙣𝙛𝙞𝙣𝙞𝙩𝙤22
┃│☮️.𝙢𝙖𝙨𝙘𝙞𝙣𝙛𝙞𝙣𝙞𝙩𝙤00
┃│☮️.𝙢𝙖𝙨𝙘𝙞𝙣𝙛𝙞𝙣𝙞𝙩𝙤𝙫𝙨
┃│☮️.𝙢𝙖𝙨𝙘𝙫𝙞𝙫𝙞𝙙𝙤14
┃│☮️.𝙢𝙖𝙨𝙘𝙫𝙞𝙫𝙞𝙙𝙤16
┃│☮️.𝙢𝙖𝙨𝙘𝙫𝙞𝙫𝙞𝙙𝙤18
┃│☮️.𝙢𝙖𝙨𝙘𝙫𝙞𝙫𝙞𝙙𝙤20
┃│☮️.𝙢𝙖𝙨𝙘𝙫𝙞𝙫𝙞𝙙𝙤22
┃│☮️.𝙢𝙖𝙨𝙘𝙫𝙞𝙫𝙞𝙙𝙤00
┃│☮️.𝙢𝙖𝙨𝙘𝙫𝙞𝙫𝙞𝙙𝙤𝙫𝙨
┃│☮️.𝙢𝙖𝙨𝙘8𝙫𝙨8
┃│☮️.𝙢𝙖𝙨𝙘12𝙫𝙨12
┃│☮️.𝙢𝙖𝙨𝙘16𝙫𝙨16
┃│☮️.𝙢𝙖𝙨𝙘𝙞𝙣𝙩𝙚𝙧𝙣𝙖4
┃│☮️.𝙢𝙖𝙨𝙘𝙞𝙣𝙩𝙚𝙧𝙣𝙖6
┃╰───────⧟⭑⧟───────•
┗━━━━━━━━━━━━━━━━━━━━━┛


┏━━━━━━━━━━━━━━━━━━━━━┓
┃「 🌀𝙇𝙄𝙉𝙆𝙎/𝘼𝙋𝙆𝙎🌀 」
┃╭───────⧟⭑⧟───────•
┃│🌀.𝙨𝙥𝙖𝙢𝘼𝙥𝙠 /𝙒𝙝𝙖𝙩𝙨𝘼𝙥𝙥
┃│🌀.𝙨𝙥𝙖𝙢𝘾𝙤𝙢𝙪 /𝘾𝙤𝙢𝙪𝙣
┃│🌀.𝙨𝙥𝙖𝙢2
┃│🌀.𝙧𝙘𝙪𝙧𝙨𝙤𝙨𝙙𝙯𝙣
┃│🌀.𝙙𝙧𝙞𝙫𝙚𝙨𝙙𝙯𝙣
┃│🌀.𝙙𝙯𝙣
┃│🌀.𝘼𝙥𝙠𝙀𝙙𝙞𝙩𝙨
┃│🌀.𝙙𝙧𝙞𝙫𝙚𝙀𝙙𝙞𝙩𝙨
┃╰───────⧟⭑⧟───────•
┗━━━━━━━━━━━━━━━━━━━━━┛


┏━━━━━━━━━━━━━━━━━━━━━┓
┃「 🍭𝙎𝙏𝙄𝘾𝙆𝙀𝙍𝙎🍭 」
┃╭───────⧟⭑⧟───────•
┃│🍭.𝙨𝙩𝙞𝙘𝙠𝙚𝙧 | 𝙨 𝙞𝙢𝙖𝙜𝙚𝙣 𝙤 𝙫𝙞𝙙𝙚𝙤
┃│🍭.𝙨𝙩𝙞𝙘𝙠𝙚𝙧 | 𝙨 𝙪𝙧𝙡 𝙙𝙚 𝙩𝙞𝙥𝙤 𝙟𝙥𝙜
┃│🍭.𝙚𝙢𝙤𝙟𝙞𝙢𝙞𝙭 😺+😆
┃│🍭.𝙦𝙘
┃│🍭.𝙨𝙘𝙞𝙧𝙘𝙡𝙚 | 𝙘𝙞𝙧𝙘𝙪𝙡𝙤 𝙞𝙢𝙖𝙜𝙚𝙣
┃│🍭.𝙨𝙚𝙢𝙤𝙟𝙞 | 𝙚𝙢𝙤𝙟𝙞 𝙩𝙞𝙥𝙤 𝙚𝙢𝙤𝙟𝙞
┃│🍭.𝙖𝙩𝙩𝙥 𝙩𝙚𝙭𝙩𝙤
┃│🍭.𝙖𝙩𝙩𝙥2 𝙩𝙚𝙭𝙩𝙤
┃│🍭.𝙩𝙩𝙥 𝙩𝙚𝙭𝙩𝙤
┃│🍭.𝙩𝙩𝙥2 𝙩𝙚𝙭𝙩𝙤
┃│🍭.𝙩𝙩𝙥3 𝙩𝙚𝙭𝙩𝙤
┃│🍭.𝙩𝙩𝙥4 𝙩𝙚𝙭𝙩𝙤
┃│🍭.𝙩𝙩𝙥5 𝙩𝙚𝙭𝙩𝙤
┃│🍭.𝙩𝙩𝙥6 𝙩𝙚𝙭𝙩𝙤
┃│🍭.𝙙𝙖𝙙𝙤
┃│🍭.𝙨𝙩𝙞𝙘𝙠𝙚𝙧𝙢𝙖𝙧𝙠𝙚𝙧 𝙧𝙚𝙨𝙥𝙤𝙣𝙙𝙚𝙧/𝙞𝙢𝙖𝙜𝙚𝙣
┃│🍭.𝙨𝙩𝙞𝙘𝙠𝙚𝙧𝙛𝙞𝙡𝙩𝙚𝙧 𝙧𝙚𝙨𝙥𝙤𝙣𝙙𝙚𝙧/𝙞𝙢𝙖𝙜𝙚𝙣
┃│🍭.𝙘𝙨 : 𝙘𝙨2
┃╰───────⧟⭑⧟───────•
┗━━━━━━━━━━━━━━━━━━━━━┛


┏━━━━━━━━━━━━━━━━━━━━━┓
┃「 🎮𝙅𝙐𝙀𝙂𝙊𝙎🎮 」
┃╭───────⧟⭑⧟───────•
┃│🎮.𝙢𝙖𝙩𝙚𝙨
┃│🎮.𝙥𝙥𝙩𝙩
┃│🎮.𝙥𝙧𝙤𝙨𝙩𝙞𝙩𝙪𝙩𝙤 <@𝙩𝙖𝙜>
┃│🎮.𝙥𝙧𝙤𝙨𝙩𝙞𝙩𝙪𝙩𝙖 <@𝙩𝙖𝙜>
┃│🎮.𝙜𝙖𝙮2 <@𝙩𝙖𝙜>
┃│🎮.𝙡𝙚𝙨𝙗𝙞𝙖𝙣𝙖 <@𝙩𝙖𝙜>
┃│🎮.𝙥𝙖𝙟𝙚𝙧𝙤 <@𝙩𝙖𝙜>
┃│🎮.𝙥𝙖𝙟𝙚𝙧𝙖 <@𝙩𝙖𝙜>
┃│🎮.𝙥𝙪𝙩𝙤 <@𝙩𝙖𝙜>
┃│🎮.𝙥𝙪𝙩𝙖 <@𝙩𝙖𝙜>
┃│🎮.𝙢𝙖𝙣𝙘𝙤 <@𝙩𝙖𝙜>
┃│🎮.𝙢𝙖𝙣𝙘𝙖 <@𝙩𝙖𝙜>
┃│🎮.𝙧𝙖𝙩𝙖 <@𝙩𝙖𝙜>
┃│🎮.𝙣𝙚𝙜𝙧𝙤 <@𝙩𝙖𝙜>
┃│🎮.𝙣𝙚𝙜𝙧𝙖 <@𝙩𝙖𝙜>
┃│🎮.𝙛𝙚𝙖 <@𝙩𝙖𝙜>
┃│🎮.𝙛𝙚𝙤 <@𝙩𝙖𝙜>
┃│🎮.𝙨𝙞𝙣𝙥𝙤𝙩𝙤 <@𝙩𝙖𝙜>
┃│🎮.𝙨𝙞𝙣𝙩𝙚𝙩𝙖𝙨 <@𝙩𝙖𝙜>
┃│🎮.𝙨𝙞𝙣𝙥𝙞𝙩𝙤 <@𝙩𝙖𝙜>
┃│🎮.𝙖𝙙𝙤𝙥𝙩𝙖𝙙𝙖 <@𝙩𝙖𝙜>
┃│🎮.𝙖𝙙𝙤𝙥𝙩𝙖𝙙𝙤 <@𝙩𝙖𝙜>
┃│🎮.𝙡𝙤𝙫𝙚
┃│🎮.𝙡𝙤𝙨10
┃│🎮.𝙨𝙪𝙞𝙩𝙥𝙫𝙥
┃│🎮.𝙨𝙡𝙤𝙩
┃│🎮.𝙨𝙞𝙢𝙞𝙨𝙞𝙢𝙞
┃│🎮.𝙜𝙚𝙢𝙞𝙣𝙞
┃│🎮.𝙥𝙧𝙚𝙜𝙪𝙣𝙩𝙖
┃│🎮.𝙘𝙪𝙖𝙣𝙙𝙤
┃│🎮.𝙨𝙝𝙞𝙥5
┃│🎮.𝙖𝙗𝙧𝙖𝙯𝙤
┃│🎮.𝙨𝙝𝙞𝙥2
┃│🎮.𝙛𝙤𝙧𝙢𝙖𝙧𝙥𝙖𝙧𝙚𝙟𝙖
┃│🎮.𝙫𝙚𝙧𝙙𝙖𝙙
┃│🎮.𝙧𝙚𝙩𝙤
┃│🎮.𝙘𝙖𝙣𝙘𝙞𝙤𝙣
┃│🎮.𝙥𝙞𝙨𝙩𝙖
┃│🎮.𝙧𝙪𝙡𝙚𝙩𝙖 
┃│🎮.𝙯𝙤𝙙𝙞𝙖𝙘
┃│🎮.𝙤𝙙𝙞𝙤
┃│🎮.𝙨𝙝𝙞𝙥
┃│🎮.𝙨𝙤𝙧𝙩𝙚𝙤
┃│🎮.𝙢𝙞𝙣𝙤𝙫𝙞𝙖
┃│🎮.𝙢𝙞𝙣𝙤𝙫𝙞𝙤
┃│🎮.𝙠𝙘𝙝𝙚𝙧𝙤
┃│🎮.𝙠𝙘𝙝𝙚𝙧𝙤
┃╰───────⧟⭑⧟───────•
┗━━━━━━━━━━━━━━━━━━━━━┛


┏━━━━━━━━━━━━━━━━━━━━━┓
┃「 🎭𝙄𝙈𝘼𝙂𝙀𝙉𝙀𝙎🎭 」
┃╭───────⧟⭑⧟───────•
┃│🖍️.𝙜𝙤𝙠𝙪
┃│🖍️.𝙫𝙚𝙜𝙚𝙩𝙖
┃│🖍️.𝙡𝙤𝙧𝙖
┃│🖍️.𝙘𝙧7
┃│🖍️.𝙨𝙥𝙞𝙙𝙚𝙧𝙢𝙖𝙣
┃│🖍️.𝙗𝙖𝙩𝙢𝙖𝙣
┃│🖍️.𝙝𝙚𝙡𝙡𝙤𝙠𝙞𝙩𝙩𝙮
┃│🖍️.𝙘𝙝𝙖𝙧𝙢𝙖𝙣𝙙𝙚𝙧
┃╰───────⧟⭑⧟───────•
┗━━━━━━━━━━━━━━━━━━━━━┛


┏━━━━━━━━━━━━━━━━━━━━━┓
┃「 🈴𝘿𝙀𝙎𝘾𝘼𝙍𝙂𝘼𝙎🈴 」
┃╭───────⧟⭑⧟───────•
┃│🈴.𝙥𝙡𝙖𝙮
┃│🈴.𝙥𝙡𝙖𝙮.1
┃│🈴.𝙥𝙡𝙖𝙮2.2
┃│🈴.𝙮𝙩𝙫.2 
┃│🈴.𝙮𝙩𝙖.2
┃│🈴.𝙥𝙡𝙖𝙮𝙡𝙞𝙨𝙩
┃│🈴.𝙨𝙥𝙤𝙩𝙞𝙛𝙮
┃│🈴.𝙨𝙥𝙤𝙩𝙞𝙛𝙮𝙙𝙡
┃│🈴.𝙩𝙞𝙠𝙩𝙤𝙠
┃│🈴.𝙞𝙣𝙨𝙩𝙖𝙜𝙧𝙖𝙢
┃│🈴.𝙢𝙚𝙙𝙞𝙖𝙛𝙞𝙧𝙚
┃│🈴.𝙜𝙙𝙧𝙞𝙫𝙚
┃│🈴.𝙩𝙬𝙞𝙩𝙩𝙚𝙧
┃│🈴.𝙮𝙩𝙖
┃│🈴.𝙮𝙩𝙫
┃│🈴.𝙞𝙢𝙖𝙜𝙚𝙣
┃│🈴.𝙞𝙖𝙞𝙢𝙖𝙜𝙚𝙣
┃│🈴.𝙥𝙞𝙣𝙩𝙚𝙧𝙚𝙨
┃│🈴.𝙞𝙜𝙨𝙩𝙤𝙧𝙮
┃╰───────⧟⭑⧟───────•
┗━━━━━━━━━━━━━━━━━━━━━┛


┏━━━━━━━━━━━━━━━━━━━━━┓
┃「 📍𝘾𝙊𝙉𝙑𝙀𝙍𝙏𝙄𝘿𝙊𝙍𝙀𝙎📍 」
┃╭───────⧟⭑⧟───────•
┃│📍.𝙩𝙤𝙞𝙢𝙜 
┃│📍.𝙩𝙤𝙢𝙥3
┃│📍.𝙩𝙤𝙥𝙩𝙩
┃│📍.𝙩𝙤𝙫𝙞𝙙𝙚𝙤
┃│📍.𝙩𝙩𝙨
┃╰───────⧟⭑⧟───────•
┗━━━━━━━━━━━━━━━━━━━━━┛


┏━━━━━━━━━━━━━━━━━━━━━┓
┃「 ♓𝙀𝙁𝙀𝘾𝙏𝙊𝙎/𝙇𝙊𝙂𝙊𝙎♓ 」
┃╭───────⧟⭑⧟───────•
┃│♓.𝙢𝙚𝙣𝙨𝙖𝙟𝙚𝙛𝙖𝙡𝙨𝙤
┃│♓.𝙡𝙤𝙜𝙤𝙨
┃│♓.𝙡𝙤𝙜𝙤𝙘𝙤𝙧𝙖𝙯𝙤𝙣
┃│♓.𝙮𝙩𝙘𝙤𝙢𝙢𝙚𝙣𝙩
┃│♓.𝙝𝙤𝙧𝙣𝙮𝙘𝙖𝙧𝙙
┃│♓.𝙞𝙩𝙨𝙨𝙤𝙨𝙩𝙪𝙥𝙞𝙙
┃│♓.𝙥𝙞𝙭𝙚𝙡𝙖𝙧
┃╰───────⧟⭑⧟───────•
┗━━━━━━━━━━━━━━━━━━━━━┛


┏━━━━━━━━━━━━━━━━━━━━━┓
┃「 💌𝙁𝙍𝘼𝙎𝙀𝙎💌 」
┃╭───────⧟⭑⧟───────•
┃│🌹.𝙥𝙞𝙧𝙤𝙥𝙤
┃│🌹.𝙘𝙤𝙣𝙨𝙚𝙟𝙤
┃│🌹.𝙛𝙧𝙖𝙨𝙚𝙧𝙤𝙢𝙖𝙣𝙩𝙞𝙘𝙖
┃╰───────⧟⭑⧟───────•
┗━━━━━━━━━━━━━━━━━━━━━┛


┏━━━━━━━━━━━━━━━━━━━━━┓
┃「 ✨𝘽𝙐𝙎𝘾𝘼𝘿𝙊𝙍𝙀𝙎✨ 」
┃╭───────⧟⭑⧟───────•
┃│🔍.𝙭𝙣𝙭𝙭𝙨𝙚𝙖𝙧𝙘𝙝
┃│🔍.𝙜𝙤𝙤𝙜𝙡𝙚
┃│🔍.𝙡𝙚𝙩𝙧𝙖
┃│🔍.𝙬𝙞𝙠𝙞𝙥𝙚𝙙𝙞𝙖
┃│🔍.𝙮𝙩𝙨𝙚𝙖𝙧𝙘𝙝
┃│🔍.𝙥𝙡𝙖𝙮𝙨𝙩𝙤𝙧𝙚
┃│🔍.𝙢𝙚𝙧𝙘𝙖𝙙𝙤𝙡𝙞𝙗𝙧𝙚
┃│🔍.𝙥𝙤𝙧𝙣𝙝𝙪𝙗𝙨𝙚𝙖𝙧𝙘𝙝
┃╰───────⧟⭑⧟───────•
┗━━━━━━━━━━━━━━━━━━━━━┛


┏━━━━━━━━━━━━━━━━━━━━━┓
┃「 ☀️𝙃𝙀𝙍𝙍𝘼𝙈𝙄𝙀𝙉𝙏𝘼𝙎☀️ 」
┃╭───────⧟⭑⧟───────•
┃│☀️.𝙘𝙡𝙞𝙢𝙖
┃│☀️.𝙖𝙛𝙠
┃│☀️.𝙤𝙘𝙧
┃│☀️.𝙘𝙖𝙡𝙘
┃│☀️.𝙙𝙚𝙡
┃│☀️.𝙬𝙝𝙖𝙩𝙢𝙪𝙨𝙞𝙘
┃│☀️.𝙦𝙧𝙘𝙤𝙙𝙚
┃│☀️.𝙩𝙧𝙖𝙙𝙪𝙘𝙞𝙧
┃╰───────⧟⭑⧟───────•
┗━━━━━━━━━━━━━━━━━━━━━┛


┏━━━━━━━━━━━━━━━━━━━━━┓
┃「 ⭐𝙀𝘾𝙊𝙉𝙊𝙈𝙄𝘼𝙎⭐ 」
┃╭───────⧟⭑⧟───────•
┃│⭐.𝙫𝙚𝙧𝙞𝙛𝙞𝙘𝙖𝙧
┃│⭐.𝙪𝙣𝙧𝙚𝙜
┃│⭐.𝙢𝙞𝙣𝙖𝙧
┃│⭐.𝙗𝙪𝙮
┃│⭐.𝙬𝙤𝙧𝙠
┃│⭐.𝙢𝙚𝙣𝙙𝙞𝙜𝙖𝙧
┃│⭐.𝙩𝙧𝙖𝙣𝙨𝙛𝙚𝙧
┃╰───────⧟⭑⧟───────•
┗━━━━━━━━━━━━━━━━━━━━━┛


┏━━━━━━━━━━━━━━━━━━━━━┓
┃「 🍂𝙊𝙒𝙉𝙀𝙍𝙎🍂 」
┃╭───────⧟⭑⧟───────•
┃│🍂.𝙟𝙤𝙞𝙣 𝚎𝚗𝚕𝚊𝚌𝚎
┃│🍂.𝙪𝙣𝙚𝙩𝙚 𝚎𝚗𝚕𝚊𝚌𝚎
┃│🍂.𝙙𝙖𝙧𝙙𝙞𝙖𝙢𝙖𝙣𝙩𝙚𝙨 𝚌𝚊𝚗𝚝𝚒𝚍𝚊𝚍
┃│🍂.𝙙𝙖𝙧𝙭𝙥 𝚌𝚊𝚗𝚝𝚒𝚍𝚊𝚍
┃│🍂.𝙙𝙖𝙧𝙜𝙖𝙩𝙖𝙘𝙤𝙞𝙣𝙨 𝚌𝚊𝚗𝚝𝚒𝚍𝚊𝚍
┃│🍂.𝙖𝙙𝙙𝙥𝙧𝙚𝙢 @𝚝𝚊𝚐 𝚌𝚊𝚗𝚝𝚒𝚍𝚊𝚍
┃│🍂.𝙖𝙙𝙙𝙥𝙧𝙚𝙢2 @𝚝𝚊𝚐 𝚌𝚊𝚗𝚝𝚒𝚍𝚊𝚍
┃│🍂.𝙖𝙙𝙙𝙥𝙧𝙚𝙢3 @𝚝𝚊𝚐 𝚌𝚊𝚗𝚝𝚒𝚍𝚊𝚍
┃│🍂.𝙖𝙙𝙙𝙥𝙧𝙚𝙢4 @𝚝𝚊𝚐 𝚌𝚊𝚗𝚝𝚒𝚍𝚊𝚍
┃│🍂.𝙞𝙙𝙞𝙤𝙢𝙖 | 𝙡𝙖𝙣𝙜𝙪𝙖𝙜𝙚
┃│🍂.𝙘𝙖𝙟𝙖𝙛𝙪𝙚𝙧𝙩𝙚
┃│🍂.𝙘𝙤𝙢𝙪𝙣𝙞𝙘𝙖𝙧|𝚝𝚎𝚡𝚝𝚘
┃│🍂.𝙗𝙧𝙤𝙖𝙙𝙘𝙖𝙨𝙩𝙘𝙝𝙖𝙩𝙨|𝚝𝚎𝚡𝚝𝚘
┃│🍂.𝙘𝙤𝙢𝙪𝙣𝙞𝙘𝙖𝙧𝙥𝙫 𝚝𝚎𝚡𝚝𝚘
┃│🍂.𝙗𝙧𝙤𝙖𝙙𝙘𝙖𝙨𝙩𝙜𝙘 𝚝𝚎𝚡𝚝𝚘
┃│🍂.𝙘𝙤𝙢𝙪𝙣𝙞𝙘𝙖𝙧𝙜𝙧𝙪𝙥𝙤𝙨 𝚝𝚎𝚡𝚝𝚘
┃│🍂.𝙗𝙤𝙧𝙧𝙖𝙧𝙩𝙢𝙥
┃│🍂.𝙙𝙚𝙡𝙚𝙭𝙥 @𝚝𝚊𝚐
┃│🍂.𝙙𝙚𝙡𝙤𝙥𝙩𝙞𝙢𝙪𝙨𝙘𝙤𝙞𝙣𝙨 @𝚝𝚊𝚐
┃│🍂.𝙙𝙚𝙡𝙙𝙞𝙖𝙢𝙖𝙣𝙩𝙚𝙨 @𝚝𝚊𝚐
┃│🍂.𝙧𝙚𝙞𝙣𝙞𝙘𝙞𝙖𝙧 | 𝙧𝙚𝙨𝙩𝙖𝙧
┃│🍂.𝘼𝙘𝙩𝙪𝙖𝙡𝙞𝙯𝙖𝙧 | 𝙪𝙥𝙙𝙖𝙩𝙚
┃│🍂.𝙖𝙙𝙙𝙥𝙧𝙚𝙢 | +𝙥𝙧𝙚𝙢 @𝚝𝚊𝚐
┃│🍂.𝙙𝙚𝙡𝙥𝙧𝙚𝙢 | -𝙥𝙧𝙚𝙢 @𝚝𝚊𝚐
┃│🍂.𝙡𝙞𝙨𝙩𝙖𝙥𝙧𝙚𝙢𝙞𝙪𝙢 | 𝙡𝙞𝙨𝙩𝙥𝙧𝙚𝙢
┃│🍂.𝙖ñ𝙖𝙙𝙞𝙧𝙙𝙞𝙖𝙢𝙖𝙣𝙩𝙚𝙨 @𝚝𝚊𝚐 𝚌𝚊𝚗𝚝𝚒𝚍𝚊𝚍
┃│🍂.𝙖ñ𝙖𝙙𝙞𝙧𝙭𝙥 @𝚝𝚊𝚐 𝚌𝚊𝚗𝚝𝚒𝚍𝚊𝚍
┃│🍂.𝙖ñ𝙖𝙙𝙞𝙧𝙘𝙤𝙞𝙣𝙨 @𝚝𝚊𝚐 𝚌𝚊𝚗𝚝𝚒𝚍𝚊𝚍
┃╰───────⧟⭑⧟───────•
┗━━━━━━━━━━━━━━━━━━━━━┛`.trim();
    if (m.isGroup) {
      // await conn.sendFile(m.chat, vn, 'menu.mp3', null, m, true, { type: 'audioMessage', ptt: true})
      const fkontak2 = {'key': {'participants': '0@s.whatsapp.net', 'remoteJid': 'status@broadcast', 'fromMe': false, 'id': 'Halo'}, 'message': {'contactMessage': {'vcard': `BEGIN:VCARD\nVERSION:3.0\nN:Sy;Bot;;;\nFN:y\nitem1.TEL;waid=${m.sender.split('@')[0]}:${m.sender.split('@')[0]}\nitem1.X-ABLabel:Ponsel\nEND:VCARD`}}, 'participant': '0@s.whatsapp.net'};
      conn.sendMessage(m.chat, {image: pp, caption: str.trim(), mentions: [...str.matchAll(/@([0-9]{5,16}|0)/g)].map((v) => v[1] + '@s.whatsapp.net')}, {quoted: m});
    } else {
      // await conn.sendFile(m.chat, vn, 'menu.mp3', null, m, true, { type: 'audioMessage', ptt: true})
      const fkontak2 = {'key': {'participants': '0@s.whatsapp.net', 'remoteJid': 'status@broadcast', 'fromMe': false, 'id': 'Halo'}, 'message': {'contactMessage': {'vcard': `BEGIN:VCARD\nVERSION:3.0\nN:Sy;Bot;;;\nFN:y\nitem1.TEL;waid=${m.sender.split('@')[0]}:${m.sender.split('@')[0]}\nitem1.X-ABLabel:Ponsel\nEND:VCARD`}}, 'participant': '0@s.whatsapp.net'};
      conn.sendMessage(m.chat, {image: pp, caption: str.trim(), mentions: [...str.matchAll(/@([0-9]{5,16}|0)/g)].map((v) => v[1] + '@s.whatsapp.net')}, {quoted: fkontak2});
    }
  } catch {
    conn.reply(m.chat, '🔮 𝙀𝙨𝙩𝙚 𝙢𝙚𝙣𝙪 𝙩𝙞𝙚𝙣𝙚 𝙪𝙣 𝙚𝙧𝙧𝙤𝙧 𝙞𝙣𝙩𝙚𝙧𝙣𝙤 𝙥𝙤𝙧 𝙡𝙤 𝙘𝙪𝙖𝙡 𝙣𝙤 𝙛𝙪𝙚 𝙥𝙤𝙨𝙞𝙗𝙡𝙚 𝙚𝙣𝙫𝙞𝙖𝙧𝙡𝙤. 𝙧𝙚𝙥𝙤𝙧𝙩𝙖𝙡𝙤 𝙖𝙡 𝙘𝙧𝙚𝙖𝙙𝙤𝙧 𝙤 𝙖𝙡 𝙨𝙩𝙖𝙛𝙛.', m);
  }
};
handler.command = /^(menu|menú|memu)$/i;
handler.exp = 50;
handler.fail = null;
export default handler;
function clockString(ms) {
  const h = isNaN(ms) ? '--' : Math.floor(ms / 3600000);
  const m = isNaN(ms) ? '--' : Math.floor(ms / 60000) % 60;
  const s = isNaN(ms) ? '--' : Math.floor(ms / 1000) % 60;
  return [h, m, s].map((v) => v.toString().padStart(2, 0)).join(':');
}